pftbest/msp430_svd/msp430-gcc-support-files/include/msp430c092.h
/* ============================================================================ */
/* Copyright (c) 2020, Texas Instruments Incorporated                           */
/*  All rights reserved.                                                        */
/*                                                                              */
/*  Redistribution and use in source and binary forms, with or without          */
/*  modification, are permitted provided that the following conditions          */
/*  are met:                                                                    */
/*                                                                              */
/*  *  Redistributions of source code must retain the above copyright           */
/*     notice, this list of conditions and the following disclaimer.            */
/*                                                                              */
/*  *  Redistributions in binary form must reproduce the above copyright        */
/*     notice, this list of conditions and the following disclaimer in the      */
/*     documentation and/or other materials provided with the distribution.     */
/*                                                                              */
/*  *  Neither the name of Texas Instruments Incorporated nor the names of      */
/*     its contributors may be used to endorse or promote products derived      */
/*     from this software without specific prior written permission.            */
/*                                                                              */
/*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" */
/*  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,       */
/*  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR      */
/*  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR            */
/*  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,       */
/*  EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,         */
/*  PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; */
/*  OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,    */
/*  WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR     */
/*  OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,              */
/*  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                          */
/* ============================================================================ */

/********************************************************************
*
* Standard register and bit definitions for the Texas Instruments
* MSP430 microcontroller.
*
* This file supports assembler and C development for
* MSP430x09x devices.
*
* Texas Instruments, Version 1.1
*
* Rev. 1.0, Initial Release
* Rev. 1.0, Added LCMP : A-POOL Latch comparator
*
*
********************************************************************/

#ifndef __msp430x09x
#define __msp430x09x

#define __MSP430_HAS_MSP430XV2_CPU__                /* Definition to show that it has MSP430XV2 CPU */

#define __MSP430_HEADER_VERSION__ 1210

#ifdef __cplusplus
extern "C" {
#endif


/*----------------------------------------------------------------------------*/
/* PERIPHERAL FILE MAP                                                        */
/*----------------------------------------------------------------------------*/

#define __MSP430_TI_HEADERS__

#include <iomacros.h>


/************************************************************
* STANDARD BITS
************************************************************/

#define BIT0                   (0x0001)
#define BIT1                   (0x0002)
#define BIT2                   (0x0004)
#define BIT3                   (0x0008)
#define BIT4                   (0x0010)
#define BIT5                   (0x0020)
#define BIT6                   (0x0040)
#define BIT7                   (0x0080)
#define BIT8                   (0x0100)
#define BIT9                   (0x0200)
#define BITA                   (0x0400)
#define BITB                   (0x0800)
#define BITC                   (0x1000)
#define BITD                   (0x2000)
#define BITE                   (0x4000)
#define BITF                   (0x8000)

/************************************************************
* STATUS REGISTER BITS
************************************************************/

#define C                      (0x0001)
#define Z                      (0x0002)
#define N                      (0x0004)
#define V                      (0x0100)
#define GIE                    (0x0008)
#define CPUOFF                 (0x0010)
#define OSCOFF                 (0x0020)
#define SCG0                   (0x0040)
#define SCG1                   (0x0080)

/* Low Power Modes coded with Bits 4-7 in SR */

#ifndef __STDC__ /* Begin #defines for assembler */
#define LPM0                   (CPUOFF)
#define LPM1                   (SCG0+CPUOFF)
#define LPM2                   (SCG1+CPUOFF)
#define LPM3                   (SCG1+SCG0+CPUOFF)
#define LPM4                   (SCG1+SCG0+OSCOFF+CPUOFF)
/* End #defines for assembler */

#else /* Begin #defines for C */
#define LPM0_bits              (CPUOFF)
#define LPM1_bits              (SCG0+CPUOFF)
#define LPM2_bits              (SCG1+CPUOFF)
#define LPM3_bits              (SCG1+SCG0+CPUOFF)
#define LPM4_bits              (SCG1+SCG0+OSCOFF+CPUOFF)

#include "in430.h"

#define LPM0      __bis_SR_register(LPM0_bits)         /* Enter Low Power Mode 0 */
#define LPM0_EXIT __bic_SR_register_on_exit(LPM0_bits) /* Exit Low Power Mode 0 */
#define LPM1      __bis_SR_register(LPM1_bits)         /* Enter Low Power Mode 1 */
#define LPM1_EXIT __bic_SR_register_on_exit(LPM1_bits) /* Exit Low Power Mode 1 */
#define LPM2      __bis_SR_register(LPM2_bits)         /* Enter Low Power Mode 2 */
#define LPM2_EXIT __bic_SR_register_on_exit(LPM2_bits) /* Exit Low Power Mode 2 */
#define LPM3      __bis_SR_register(LPM3_bits)         /* Enter Low Power Mode 3 */
#define LPM3_EXIT __bic_SR_register_on_exit(LPM3_bits) /* Exit Low Power Mode 3 */
#define LPM4      __bis_SR_register(LPM4_bits)         /* Enter Low Power Mode 4 */
#define LPM4_EXIT __bic_SR_register_on_exit(LPM4_bits) /* Exit Low Power Mode 4 */
#endif /* End #defines for C */

/************************************************************
* PERIPHERAL FILE MAP
************************************************************/

/************************************************************
* A-POOL
************************************************************/
#define __MSP430_HAS_APOOL__                  /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_APOOL__ 0x01A0
#define APOOL_BASE             __MSP430_BASEADDRESS_APOOL__

sfr_w(APCNF);                                 /* A-POOL Configuration Register */
sfr_b(APCNF_L);                               /* A-POOL Configuration Register */
sfr_b(APCNF_H);                               /* A-POOL Configuration Register */
sfr_w(APCTL);                                 /* A-POOL Control Register 1 */
sfr_b(APCTL_L);                               /* A-POOL Control Register 1 */
sfr_b(APCTL_H);                               /* A-POOL Control Register 1 */
sfr_w(APOMR);                                 /* A-POOL Operation Mode Register 2 */
sfr_b(APOMR_L);                               /* A-POOL Operation Mode Register 2 */
sfr_b(APOMR_H);                               /* A-POOL Operation Mode Register 2 */
sfr_w(APVDIV);                                /* A-POOL Voltage Divider Register 3 */
sfr_b(APVDIV_L);                              /* A-POOL Voltage Divider Register 3 */
sfr_b(APVDIV_H);                              /* A-POOL Voltage Divider Register 3 */
sfr_w(APTRIM);                                /* A-POOL trimming register */
sfr_b(APTRIM_L);                              /* A-POOL trimming register */
sfr_b(APTRIM_H);                              /* A-POOL trimming register */
sfr_w(APINT);                                 /* A-POOL Integer Conversion Register */
sfr_b(APINT_L);                               /* A-POOL Integer Conversion Register */
sfr_b(APINT_H);                               /* A-POOL Integer Conversion Register */
sfr_w(APINTB);                                /* A-POOL Integer Conversion Buffer Register */
sfr_b(APINTB_L);                              /* A-POOL Integer Conversion Buffer Register */
sfr_b(APINTB_H);                              /* A-POOL Integer Conversion Buffer Register */
sfr_w(APFRACT);                               /* A-POOL Fractional Conversion Register */
sfr_b(APFRACT_L);                             /* A-POOL Fractional Conversion Register */
sfr_b(APFRACT_H);                             /* A-POOL Fractional Conversion Register */
sfr_w(APFRACTB);                              /* A-POOL Fractional Conversion Buffer Register */
sfr_b(APFRACTB_L);                            /* A-POOL Fractional Conversion Buffer Register */
sfr_b(APFRACTB_H);                            /* A-POOL Fractional Conversion Buffer Register */
sfr_w(APIFG);                                 /* A-POOL Interrupt Flag Register */
sfr_b(APIFG_L);                               /* A-POOL Interrupt Flag Register */
sfr_b(APIFG_H);                               /* A-POOL Interrupt Flag Register */
sfr_w(APIE);                                  /* A-POOL Interrupt Enable Register */
sfr_b(APIE_L);                                /* A-POOL Interrupt Enable Register */
sfr_b(APIE_H);                                /* A-POOL Interrupt Enable Register */
sfr_w(APIV);                                  /* A-POOL Interrupt Vector Word */
sfr_b(APIV_L);                                /* A-POOL Interrupt Vector Word */
sfr_b(APIV_H);                                /* A-POOL Interrupt Vector Word */

/* APCNF Control Bits */
#define TA0EN                  (0x0001)       /* A-POOL TimerA0 trigger enable */
#define TA1EN                  (0x0002)       /* A-POOL TimerA1 trigger enable */
#define DFSET0                 (0x0004)       /* A-POOL Deglitch Filter Bit: 0 */
#define DFSET1                 (0x0008)       /* A-POOL Deglitch Filter Bit: 1 */
#define LCMP                   (0x0010)       /* A-POOL Latch comparator */
#define CMPON                  (0x0020)       /* A-POOL Comparator enable */
#define DBON                   (0x0040)       /* A-POOL DAC buffer enable signal */
#define CONVON                 (0x0080)       /* A-POOL Enable for converter's resistor ladder */
#define CLKSEL0                (0x0100)       /* A-POOL Conversion clock select Bit: 0 */
#define CLKSEL1                (0x0200)       /* A-POOL Conversion clock select Bit: 1 */
#define EOCBU                  (0x0400)       /* A-POOL Enable bit for loading conversion buffer */
#define ATBU                   (0x0800)       /* A-POOL Automatic update of conversion register */
#define A3PSEL                 (0x1000)       /* A-POOL Analog input A3 access Bit */
#define APREFON                (0x2000)       /* A-POOL Internal voltage reference enable */
#define VREFEN                 (0x4000)       /* A-POOL Reference voltage pin enable */
//#define RESERVED             (0x8000)  /* A-POOL */

/* APCNF Control Bits */
#define TA0EN_L                (0x0001)       /* A-POOL TimerA0 trigger enable */
#define TA1EN_L                (0x0002)       /* A-POOL TimerA1 trigger enable */
#define DFSET0_L               (0x0004)       /* A-POOL Deglitch Filter Bit: 0 */
#define DFSET1_L               (0x0008)       /* A-POOL Deglitch Filter Bit: 1 */
#define LCMP_L                 (0x0010)       /* A-POOL Latch comparator */
#define CMPON_L                (0x0020)       /* A-POOL Comparator enable */
#define DBON_L                 (0x0040)       /* A-POOL DAC buffer enable signal */
#define CONVON_L               (0x0080)       /* A-POOL Enable for converter's resistor ladder */
//#define RESERVED             (0x8000)  /* A-POOL */

/* APCNF Control Bits */
#define CLKSEL0_H              (0x0001)       /* A-POOL Conversion clock select Bit: 0 */
#define CLKSEL1_H              (0x0002)       /* A-POOL Conversion clock select Bit: 1 */
#define EOCBU_H                (0x0004)       /* A-POOL Enable bit for loading conversion buffer */
#define ATBU_H                 (0x0008)       /* A-POOL Automatic update of conversion register */
#define A3PSEL_H               (0x0010)       /* A-POOL Analog input A3 access Bit */
#define APREFON_H              (0x0020)       /* A-POOL Internal voltage reference enable */
#define VREFEN_H               (0x0040)       /* A-POOL Reference voltage pin enable */
//#define RESERVED             (0x8000)  /* A-POOL */

#define DFSET_0                (0x0000)       /* A-POOL Deglitch Filter select: 0 */
#define DFSET_1                (0x0004)       /* A-POOL Deglitch Filter select: 1 */
#define DFSET_2                (0x0008)       /* A-POOL Deglitch Filter select: 2 */
#define DFSET_3                (0x000C)       /* A-POOL Deglitch Filter select: 3 */

#define CLKSEL_0               (0x0000)       /* A-POOL Conversion clock select: 0 */
#define CLKSEL_1               (0x0100)       /* A-POOL Conversion clock select: 1 */
#define CLKSEL_2               (0x0200)       /* A-POOL Conversion clock select: 2 */
#define CLKSEL_VLOCLK          (0x0000)       /* A-POOL Conversion clock select: VLOCLK */
#define CLKSEL_MCLK            (0x0100)       /* A-POOL Conversion clock select: MCLK */
#define CLKSEL_SMCLK           (0x0200)       /* A-POOL Conversion clock select: SMCLK */

/* APCTL Control Bits */
#define ODEN                   (0x0001)       /* A-POOL Output driver enable */
#define OSWP                   (0x0002)       /* A-POOL Output swap */
#define OSEL                   (0x0004)       /* A-POOL Output buffer select */
#define SLOPE                  (0x0008)       /* A-POOL Slope select of converter */
#define APNSEL0                (0x0010)       /* A-POOL Neg. Channel Input Select 0 */
#define APNSEL1                (0x0020)       /* A-POOL Neg. Channel Input Select 1 */
#define APNSEL2                (0x0040)       /* A-POOL Neg. Channel Input Select 2 */
#define APNSEL3                (0x0080)       /* A-POOL Neg. Channel Input Select 3 */
#define RUNSTOP                (0x0100)       /* A-POOL Converter's Run/Stop bit */
#define SBSTP                  (0x0200)       /* A-POOL Saturation based conversion stop enable */
#define CBSTP                  (0x0400)       /* A-POOL Comparator based conversion stop enable */
#define TBSTP                  (0x0800)       /* A-POOL Timer based conversion stop enable for TimerA0 */
#define APPSEL0                (0x1000)       /* A-POOL Pos. Channel Input Select 0 */
#define APPSEL1                (0x2000)       /* A-POOL Pos. Channel Input Select 1 */
#define APPSEL2                (0x4000)       /* A-POOL Pos. Channel Input Select 2 */
#define APPSEL3                (0x8000)       /* A-POOL Pos. Channel Input Select 3 */

/* APCTL Control Bits */
#define ODEN_L                 (0x0001)       /* A-POOL Output driver enable */
#define OSWP_L                 (0x0002)       /* A-POOL Output swap */
#define OSEL_L                 (0x0004)       /* A-POOL Output buffer select */
#define SLOPE_L                (0x0008)       /* A-POOL Slope select of converter */
#define APNSEL0_L              (0x0010)       /* A-POOL Neg. Channel Input Select 0 */
#define APNSEL1_L              (0x0020)       /* A-POOL Neg. Channel Input Select 1 */
#define APNSEL2_L              (0x0040)       /* A-POOL Neg. Channel Input Select 2 */
#define APNSEL3_L              (0x0080)       /* A-POOL Neg. Channel Input Select 3 */

/* APCTL Control Bits */
#define RUNSTOP_H              (0x0001)       /* A-POOL Converter's Run/Stop bit */
#define SBSTP_H                (0x0002)       /* A-POOL Saturation based conversion stop enable */
#define CBSTP_H                (0x0004)       /* A-POOL Comparator based conversion stop enable */
#define TBSTP_H                (0x0008)       /* A-POOL Timer based conversion stop enable for TimerA0 */
#define APPSEL0_H              (0x0010)       /* A-POOL Pos. Channel Input Select 0 */
#define APPSEL1_H              (0x0020)       /* A-POOL Pos. Channel Input Select 1 */
#define APPSEL2_H              (0x0040)       /* A-POOL Pos. Channel Input Select 2 */
#define APPSEL3_H              (0x0080)       /* A-POOL Pos. Channel Input Select 3 */

