pftbest/msp430_svd/msp430-gcc-support-files/include/msp430c092.h
#define APNSEL_0               (0x0000)       /* A-POOL V- terminal Input Select: Channel 0 */
#define APNSEL_1               (0x0010)       /* A-POOL V- terminal Input Select: Channel 1 */
#define APNSEL_2               (0x0020)       /* A-POOL V- terminal Input Select: Channel 2 */
#define APNSEL_3               (0x0030)       /* A-POOL V- terminal Input Select: Channel 3 */
#define APNSEL_4               (0x0040)       /* A-POOL V- terminal Input Select: Channel 4 */
#define APNSEL_5               (0x0050)       /* A-POOL V- terminal Input Select: Channel 5 */
#define APNSEL_6               (0x0060)       /* A-POOL V- terminal Input Select: Channel 6 */
#define APNSEL_7               (0x0070)       /* A-POOL V- terminal Input Select: Channel 7 */

#define APPSEL_0               (0x0000)       /* A-POOL V+ Terminal Input Select: Channel 0 */
#define APPSEL_1               (0x1000)       /* A-POOL V+ Terminal Input Select: Channel 1 */
#define APPSEL_2               (0x2000)       /* A-POOL V+ Terminal Input Select: Channel 2 */
#define APPSEL_3               (0x3000)       /* A-POOL V+ Terminal Input Select: Channel 3 */
#define APPSEL_4               (0x4000)       /* A-POOL V+ Terminal Input Select: Channel 4 */
#define APPSEL_5               (0x5000)       /* A-POOL V+ Terminal Input Select: Channel 5 */
#define APPSEL_6               (0x6000)       /* A-POOL V+ Terminal Input Select: Channel 6 */
#define APPSEL_7               (0x7000)       /* A-POOL V+ Terminal Input Select: Channel 7 */
#define APPSEL_8               (0x8000)       /* A-POOL V+ Terminal Input Select: Channel 8 */

/* APVDIV Control Bits */
#define A0DIV                  (0x0001)       /* A-POOL Analog channel #0 voltage divider control */
#define A1DIV                  (0x0002)       /* A-POOL Analog channel #1 voltage divider control */
#define A2DIV0                 (0x0004)       /* A-POOL Analog channel #2 voltage divider control Bit : 0 */
#define A2DIV1                 (0x0008)       /* A-POOL Analog channel #2 voltage divider control Bit : 1 */
#define A3DIV0                 (0x0010)       /* A-POOL Analog channel #3 voltage divider control Bit : 0 */
#define A3DIV1                 (0x0020)       /* A-POOL Analog channel #3 voltage divider control Bit : 0 */
#define TMPSEN                 (0x0040)       /* A-POOL Temperature sensor enable */
#define VCCDIVEN               (0x0080)       /* A-POOL VCC voltage divider enable */
//#define RESERVED             (0x0100)  /* A-POOL */
//#define RESERVED             (0x0200)  /* A-POOL */
#define CLKTRIM0               (0x0400)       /* A-POOL Clock trimming Bit : 0 */
#define CLKTRIM1               (0x0800)       /* A-POOL Clock trimming Bit : 1 */
//#define RESERVED             (0x1000)  /* A-POOL */
//#define RESERVED             (0x2000)  /* A-POOL */
//#define RESERVED             (0x4000)  /* A-POOL */
//#define RESERVED             (0x8000)  /* A-POOL */

/* APVDIV Control Bits */
#define A0DIV_L                (0x0001)       /* A-POOL Analog channel #0 voltage divider control */
#define A1DIV_L                (0x0002)       /* A-POOL Analog channel #1 voltage divider control */
#define A2DIV0_L               (0x0004)       /* A-POOL Analog channel #2 voltage divider control Bit : 0 */
#define A2DIV1_L               (0x0008)       /* A-POOL Analog channel #2 voltage divider control Bit : 1 */
#define A3DIV0_L               (0x0010)       /* A-POOL Analog channel #3 voltage divider control Bit : 0 */
#define A3DIV1_L               (0x0020)       /* A-POOL Analog channel #3 voltage divider control Bit : 0 */
#define TMPSEN_L               (0x0040)       /* A-POOL Temperature sensor enable */
#define VCCDIVEN_L             (0x0080)       /* A-POOL VCC voltage divider enable */
//#define RESERVED             (0x0100)  /* A-POOL */
//#define RESERVED             (0x0200)  /* A-POOL */
//#define RESERVED             (0x1000)  /* A-POOL */
//#define RESERVED             (0x2000)  /* A-POOL */
//#define RESERVED             (0x4000)  /* A-POOL */
//#define RESERVED             (0x8000)  /* A-POOL */

/* APVDIV Control Bits */
//#define RESERVED             (0x0100)  /* A-POOL */
//#define RESERVED             (0x0200)  /* A-POOL */
#define CLKTRIM0_H             (0x0004)       /* A-POOL Clock trimming Bit : 0 */
#define CLKTRIM1_H             (0x0008)       /* A-POOL Clock trimming Bit : 1 */
//#define RESERVED             (0x1000)  /* A-POOL */
//#define RESERVED             (0x2000)  /* A-POOL */
//#define RESERVED             (0x4000)  /* A-POOL */
//#define RESERVED             (0x8000)  /* A-POOL */

#define A2DIV_0                (0x0000)       /* A-POOL Analog channel #2 voltage divider control: 0 */
#define A2DIV_1                (0x0004)       /* A-POOL Analog channel #2 voltage divider control: 1 */
#define A2DIV_2                (0x0008)       /* A-POOL Analog channel #2 voltage divider control: 2 */
#define A2DIV_3                (0x000C)       /* A-POOL Analog channel #2 voltage divider control: 3 */

#define A3DIV_0                (0x0000)       /* A-POOL Analog channel #3 voltage divider control: 0 */
#define A3DIV_1                (0x0010)       /* A-POOL Analog channel #3 voltage divider control: 1 */
#define A3DIV_2                (0x0020)       /* A-POOL Analog channel #3 voltage divider control: 2 */
#define A3DIV_3                (0x0030)       /* A-POOL Analog channel #3 voltage divider control: 3 */

#define CLKTRIM_0              (0x0000)       /* A-POOL Clock trimming: 0 */
#define CLKTRIM_1              (0x0400)       /* A-POOL Clock trimming: 1 */
#define CLKTRIM_2              (0x0800)       /* A-POOL Clock trimming: 2 */
#define CLKTRIM_3              (0x0C00)       /* A-POOL Clock trimming: 3 */

#define REFTRIM_0              (0x0000)       /* A-POOL Reference trimming: 0 */
#define REFTRIM_1              (0x1000)       /* A-POOL Reference trimming: 1 */
#define REFTRIM_2              (0x2000)       /* A-POOL Reference trimming: 2 */
#define REFTRIM_3              (0x3000)       /* A-POOL Reference trimming: 3 */
#define REFTRIM_4              (0x4000)       /* A-POOL Reference trimming: 4 */
#define REFTRIM_5              (0x5000)       /* A-POOL Reference trimming: 5 */
#define REFTRIM_6              (0x6000)       /* A-POOL Reference trimming: 6 */
#define REFTRIM_7              (0x7000)       /* A-POOL Reference trimming: 7 */

/* APTRIM Control Bits */
#define REFTSEL                (0x0001)       /* A-POOL Register bank used for the reference trimming */
#define REFTRIM0               (0x1000)       /* A-POOL Reference trimming bit: 0 */
#define REFTRIM1               (0x2000)       /* A-POOL Reference trimming bit: 1 */
#define REFTRIM2               (0x4000)       /* A-POOL Reference trimming bit: 2 */
#define REFTRIM3               (0x8000)       /* A-POOL Reference trimming bit: 3 */

/* APTRIM Control Bits */
#define REFTSEL_L              (0x0001)       /* A-POOL Register bank used for the reference trimming */

/* APTRIM Control Bits */
#define REFTRIM0_H             (0x0010)       /* A-POOL Reference trimming bit: 0 */
#define REFTRIM1_H             (0x0020)       /* A-POOL Reference trimming bit: 1 */
#define REFTRIM2_H             (0x0040)       /* A-POOL Reference trimming bit: 2 */
#define REFTRIM3_H             (0x0080)       /* A-POOL Reference trimming bit: 3 */

