pftbest/msp430_svd/msp430-gcc-support-files/include/msp430c092.h
/* APOMR Control Bits */
#define CLKDIV0                (0x0001)       /* A-POOL Prescaler Control Bit: 0 */
#define CLKDIV1                (0x0002)       /* A-POOL Prescaler Control Bit: 1 */
#define CLKDIV2                (0x0004)       /* A-POOL Prescaler Control Bit: 2 */
#define SAREN                  (0x0008)       /* A-POOL SAR conversion enable */
#define CTEN                   (0x0100)       /* A-POOL Continuous time mode of comparator */
#define AZCMP                  (0x0200)       /* A-POOL Clocked zero compensated long term comparison */
#define AZSWREQ                (0x0400)       /* A-POOL SW request for Auto Zero Phase */
#define SVMINH                 (0x0800)       /* A-POOL Suppress the generation of an SVM interrupt event. */

/* APOMR Control Bits */
#define CLKDIV0_L              (0x0001)       /* A-POOL Prescaler Control Bit: 0 */
#define CLKDIV1_L              (0x0002)       /* A-POOL Prescaler Control Bit: 1 */
#define CLKDIV2_L              (0x0004)       /* A-POOL Prescaler Control Bit: 2 */
#define SAREN_L                (0x0008)       /* A-POOL SAR conversion enable */

/* APOMR Control Bits */
#define CTEN_H                 (0x0001)       /* A-POOL Continuous time mode of comparator */
#define AZCMP_H                (0x0002)       /* A-POOL Clocked zero compensated long term comparison */
#define AZSWREQ_H              (0x0004)       /* A-POOL SW request for Auto Zero Phase */
#define SVMINH_H               (0x0008)       /* A-POOL Suppress the generation of an SVM interrupt event. */

#define CLKDIV_0               (0x0000)       /* A-POOL Prescaler Control 0 : /1 */
#define CLKDIV_1               (0x0001)       /* A-POOL Prescaler Control 1 : /2 */
#define CLKDIV_2               (0x0002)       /* A-POOL Prescaler Control 2 : /4 */
#define CLKDIV_3               (0x0003)       /* A-POOL Prescaler Control 3 : /8 */
#define CLKDIV_4               (0x0004)       /* A-POOL Prescaler Control 4 : /16 */
#define CLKDIV_5               (0x0005)       /* A-POOL Prescaler Control 5 : /32 */
#define CLKDIV__1              (0x0000)       /* A-POOL Prescaler Control 0 : /1 */
#define CLKDIV__2              (0x0001)       /* A-POOL Prescaler Control 1 : /2 */
#define CLKDIV__4              (0x0002)       /* A-POOL Prescaler Control 2 : /4 */
#define CLKDIV__8              (0x0003)       /* A-POOL Prescaler Control 3 : /8 */
#define CLKDIV__16             (0x0004)       /* A-POOL Prescaler Control 4 : /16 */
#define CLKDIV__32             (0x0005)       /* A-POOL Prescaler Control 5 : /32 */

/* APIFG Control Bits */
#define EOCIFG                 (0x0001)       /* A-POOL End of conversion interrupt flag */
#define CFIFG                  (0x0002)       /* A-POOL Comparator falling edge interrupt flag */
#define CRIFG                  (0x0004)       /* A-POOL Comparator rising edge interrupt flag */
#define REFOKIFG               (0x0008)       /* A-POOL Reference voltage ready interrupt flag */

/* APIFG Control Bits */
#define EOCIFG_L               (0x0001)       /* A-POOL End of conversion interrupt flag */
#define CFIFG_L                (0x0002)       /* A-POOL Comparator falling edge interrupt flag */
#define CRIFG_L                (0x0004)       /* A-POOL Comparator rising edge interrupt flag */
#define REFOKIFG_L             (0x0008)       /* A-POOL Reference voltage ready interrupt flag */

/* APIFG Control Bits */
#define EOCIE                  (0x0001)       /* A-POOL End of conversion interrupt enable */
#define CFIE                   (0x0002)       /* A-POOL Comparator falling edge interrupt enable */
#define CRIE                   (0x0004)       /* A-POOL Comparator rising edge interrupt enable */
#define REFIKIE                (0x0008)       /* A-POOL Reference voltage ready interrupt enable */

/* APIFG Control Bits */
#define EOCIE_L                (0x0001)       /* A-POOL End of conversion interrupt enable */
#define CFIE_L                 (0x0002)       /* A-POOL Comparator falling edge interrupt enable */
#define CRIE_L                 (0x0004)       /* A-POOL Comparator rising edge interrupt enable */
#define REFIKIE_L              (0x0008)       /* A-POOL Reference voltage ready interrupt enable */

/* APIV Definitions */
#define APIV_NONE              (0x0000)       /* No Interrupt pending */
#define APIV_EOCIF             (0x0002)       /* EOCIFG */
#define APIV_CFIFG             (0x0004)       /* CFIFG */
#define APIV_CRIFG             (0x0006)       /* CRIFG */

/************************************************************
* COMPACT CLOCK SYSTEM
************************************************************/
#define __MSP430_HAS_CCS__                    /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_CCS__ 0x0160
#define CCS_BASE               __MSP430_BASEADDRESS_CCS__

sfr_w(CCSCTL0);                               /* CCS Control Register 0 */
sfr_b(CCSCTL0_L);                             /* CCS Control Register 0 */
sfr_b(CCSCTL0_H);                             /* CCS Control Register 0 */
sfr_w(CCSCTL1);                               /* CCS Control Register 1 */
sfr_b(CCSCTL1_L);                             /* CCS Control Register 1 */
sfr_b(CCSCTL1_H);                             /* CCS Control Register 1 */
sfr_w(CCSCTL2);                               /* CCS Control Register 2 */
sfr_b(CCSCTL2_L);                             /* CCS Control Register 2 */
sfr_b(CCSCTL2_H);                             /* CCS Control Register 2 */
sfr_w(CCSCTL4);                               /* CCS Control Register 4 */
sfr_b(CCSCTL4_L);                             /* CCS Control Register 4 */
sfr_b(CCSCTL4_H);                             /* CCS Control Register 4 */
sfr_w(CCSCTL5);                               /* CCS Control Register 5 */
sfr_b(CCSCTL5_L);                             /* CCS Control Register 5 */
sfr_b(CCSCTL5_H);                             /* CCS Control Register 5 */
sfr_w(CCSCTL6);                               /* CCS Control Register 6 */
sfr_b(CCSCTL6_L);                             /* CCS Control Register 6 */
sfr_b(CCSCTL6_H);                             /* CCS Control Register 6 */
sfr_w(CCSCTL7);                               /* CCS Control Register 7 */
sfr_b(CCSCTL7_L);                             /* CCS Control Register 7 */
sfr_b(CCSCTL7_H);                             /* CCS Control Register 7 */
sfr_w(CCSCTL8);                               /* CCS Control Register 8 */
sfr_b(CCSCTL8_L);                             /* CCS Control Register 8 */
sfr_b(CCSCTL8_H);                             /* CCS Control Register 8 */

